Tekla.Structures.AnalysisInternal.DotAnalysisNodeLink
Serialization structure for AnalysisNodeLink.

Tekla.Structures.AnalysisInternal.DotAnalysisNodeLink._AnalysisObject
The analysis object.

Tekla.Structures.AnalysisInternal.DotAnalysisNodeLink._CoordinateSystem
The coordinate system of the analysis node link.

Tekla.Structures.AnalysisInternal.DotAnalysisNodeLink._StartNodeID
The identifier of the start node.

Tekla.Structures.AnalysisInternal.DotAnalysisNodeLink._EndNodeID
The identifier of the end node.

Tekla.Structures.AnalysisInternal.DotAnalysisNodeLink._StartConnectivity
The start connectivity of the analysis node link.

Tekla.Structures.AnalysisInternal.DotAnalysisNodeLink._EndConnectivity
The end connectivity of the analysis node link.

Tekla.Structures.AnalysisInternal.DotAnalysisNodeLink._Disabled
This indicates whether the analysis node link is disabled.

Tekla.Structures.AnalysisInternal.DotAnalysisNodeLink._IsUserNodeLink
This indicates whether the analysis node is a user node link.

Tekla.Structures.AnalysisInternal.DotAnalysisNodeLink._IsUserConnectivity
This indicates whether the analysis node has a user defined support..

Tekla.Structures.AnalysisInternal.DotAnalysisNodeLink._NumberOfOwnerPartIDs
The number of owner part identifier.

Tekla.Structures.AnalysisInternal.DotAnalysisNodeLink._OwnerPartIDs
The list of identifier of the owner parts.

Tekla.Structures.AnalysisInternal.DotAnalysisNodeLink.ToStruct(Tekla.Structures.Analysis.AnalysisNodeLink)
DO NOT USE! For internal usage only!
P: P.

Tekla.Structures.AnalysisInternal.DotAnalysisNodeLink.FromStruct(Tekla.Structures.Analysis.AnalysisNodeLink)
DO NOT USE! For internal usage only!
P: P.